# DataFrames

Pandas DataFrame is two-dimensional size-mutable, potentially heterogeneous tabular data structure with labeled axes (rows and columns).

In [1]:
import pandas as pd

In [2]:
lis=['Ojas','Gupta','Avni','Sharma']

In [3]:
val=pd.DataFrame(lis)

In [4]:
val

        0
0    Ojas
1   Gupta
2    Avni
3  Sharma

In [12]:
di={'Name':['Ojas','Rahul','Simran','Shivam'],'age':[21,22,23,24],'gender':['M','M','F','M']}

In [13]:
data=pd.DataFrame(di)

In [7]:
print(data)

     Name  age gender
0    Ojas   21      M
1   Rahul   22      M
2  Simran   23      F
3  Shivam   24      M

In [8]:
data = [{'a': 1, 'b': 2},{'a': 5, 'b': 10, 'c': 20}]

In [10]:
d=pd.DataFrame(data)

In [11]:
print(d)

   a   b     c
0  1   2   NaN
1  5  10  20.0

In [14]:
data

     Name  age gender
0    Ojas   21      M
1   Rahul   22      M
2  Simran   23      F
3  Shivam   24      M

In [15]:
data.Name

0      Ojas
1     Rahul
2    Simran
3    Shivam
Name: Name, dtype: object

In [16]:
data.age

0    21
1    22
2    23
3    24
Name: age, dtype: int64

In [17]:
data.gender

0    M
1    M
2    F
3    M
Name: gender, dtype: object